/*************************************************************************
【文件名】                 Importer.cpp
【功能模块和目的】         实现导入类基类
【开发者及日期】           刘东琛 2024.8.11
【更改记录】               （若修改过则必需注明）
*************************************************************************/
#include "Importer.hpp"

/*************************************************************************
【函数名称】       Importer
【函数功能】       Importer默认构造函数
【参数】           无
【返回值】         无
【开发者及日期】   刘东琛 2024.8.11
【更改记录】       （若有修改，则必需注明）
*************************************************************************/
Importer::Importer() {

}

/*************************************************************************
【函数名称】       Importer
【函数功能】       Importer拷贝构造函数
【参数】           被拷贝的对象
【返回值】         无
【开发者及日期】   刘东琛 2024.8.11
【更改记录】       （若有修改，则必需注明）
*************************************************************************/
Importer::Importer(const Importer& Source) {

}

/*************************************************************************
【函数名称】       operator=()
【函数功能】       重载赋值运算符
【参数】           无
【返回值】         无
【开发者及日期】   刘东琛 2024.8.11
【更改记录】       （若有修改，则必需注明）
*************************************************************************/
Importer& Importer::operator=(const Importer& Source) {
    return *this;
}

/*************************************************************************
【函数名称】       ~Importer
【函数功能】       Importer析构函数
【参数】           无
【返回值】         无
【开发者及日期】   刘东琛 2024.8.11
【更改记录】       （若有修改，则必需注明）
*************************************************************************/
Importer::~Importer() {

}